In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly
import plotly.graph_objects as go

import os
os.chdir('/home/luisfernando/Git Code/Introduction-to-Data-Analysis/Lecture 2') # You must open the directory where the file is located before pening it before
df = pd.read_excel("adult.xlsx") # This function opens the data frame

In [2]:
df

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K
2,38,Private,215646,HS-grad,Divorced,Not-in-family,Male,40,<=50K
3,53,Private,234721,11th,Married-civ-spouse,Husband,Male,40,<=50K
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K
...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K
32557,40,Private,154374,HS-grad,Married-civ-spouse,Husband,Male,40,>50K
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K

## What is a DataFrame?

A DataFrame is an object. The pandas library uses the DataFrame object to analyze data.

### Columns

The main way of interfacing with a dataFrame will be calling its columns. Pandas is heavily column based.

In [3]:
df.columns

Index(['age', 'workclass', 'capital-gain', 'education', 'marital-status',
       'relationship', 'sex', 'Hours-per-week', 'income'],
      dtype='object')

Single columns can be called with two methods:

In [4]:
df['age']

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

In [5]:
df.age

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

In [6]:
df['capital-gain']

0         77516
1         83311
2        215646
3        234721
4        338409
          ...
32556    257302
32557    154374
32558    151910
32559    201490
32560    287927
Name: capital-gain, Length: 32561, dtype: int64

### Rows

In [ ]:
# Single selections using iloc and DataFrame
# Rows:
#df.iloc[0] # first row of data frame 
#df.iloc[1] # second row of data frame 
# df.iloc[-1] # last row of data frame 
# Columns:
# df.iloc[:,0] # first column of data frame 
# df.iloc[:,1] # second column of data frame 
# df.iloc[:,-1] # last column of data frame

### Datatypes

It is important to know what particular data you are working with. This prevents errors in you future work

In [7]:
df.dtypes

age                int64
workclass         object
capital-gain       int64
education         object
marital-status    object
relationship      object
sex               object
Hours-per-week     int64
income            object
dtype: object

### Index

In [8]:
df.index

RangeIndex(start=0, stop=32561, step=1)

### Some Basic Methods (Functions

In [9]:
df.age.min()

17

In [10]:
df.age.max()

90

In [11]:
df.age.mean()

38.58164675532078

In [12]:
df['capital-gain'].mean()

189778.36651208502

In [13]:
df['capital-gain'].max()

1484705

In [14]:
df['capital-gain'].sum()

6179373392

In [15]:
df.corr()

                     age  capital-gain  Hours-per-week
age             1.000000     -0.076646        0.068756
capital-gain   -0.076646      1.000000       -0.018768
Hours-per-week  0.068756     -0.018768        1.000000

In [16]:
df.corr().index

Index(['age', 'capital-gain', 'Hours-per-week'], dtype='object')

### Pivoting

For next Lecture :)

Use boolean to filter some desired values

List all the clients who are female

In [17]:
df

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K
2,38,Private,215646,HS-grad,Divorced,Not-in-family,Male,40,<=50K
3,53,Private,234721,11th,Married-civ-spouse,Husband,Male,40,<=50K
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K
...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K
32557,40,Private,154374,HS-grad,Married-civ-spouse,Husband,Male,40,>50K
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K

In [20]:
df.sex[4]

' Female'

In [21]:
df.sex == ' Female'

0        False
1        False
2        False
3        False
4         True
         ...
32556     True
32557    False
32558     True
32559    False
32560     True
Name: sex, Length: 32561, dtype: bool

In [25]:
df[df.sex == ' Female']

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K
5,37,Private,284582,Masters,Married-civ-spouse,Wife,Female,40,<=50K
6,49,Private,160187,9th,Married-spouse-absent,Not-in-family,Female,16,<=50K
8,31,Private,45781,Masters,Never-married,Not-in-family,Female,50,>50K
12,23,Private,122272,Bachelors,Never-married,Own-child,Female,30,<=50K
...,...,...,...,...,...,...,...,...,...
32546,37,Private,198216,Assoc-acdm,Divorced,Not-in-family,Female,40,<=50K
32549,43,State-gov,255835,Some-college,Divorced,Other-relative,Female,40,<=50K
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K

In [26]:
df.columns

Index(['age', 'workclass', 'capital-gain', 'education', 'marital-status',
       'relationship', 'sex', 'Hours-per-week', 'income'],
      dtype='object')

In [27]:
df['education'][df.sex == ' Female']

4            Bachelors
5              Masters
6                  9th
8              Masters
12           Bachelors
             ...
32546       Assoc-acdm
32549     Some-college
32556       Assoc-acdm
32558          HS-grad
32560          HS-grad
Name: education, Length: 10771, dtype: object

In [30]:
df[['age', 'capital-gain', 'education',  'Hours-per-week', 'income']][df.sex == ' Male']

       age  capital-gain      education  Hours-per-week  income
0       39         77516      Bachelors              40   <=50K
1       50         83311      Bachelors              13   <=50K
2       38        215646        HS-grad              40   <=50K
3       53        234721           11th              40   <=50K
7       52        209642        HS-grad              45    >50K
...    ...           ...            ...             ...     ...
32553   32        116138        Masters              11   <=50K
32554   53        321865        Masters              40    >50K
32555   22        310152   Some-college              40   <=50K
32557   40        154374        HS-grad              40    >50K
32559   22        201490        HS-grad              20   <=50K

[21790 rows x 5 columns]

In [31]:
df

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K
2,38,Private,215646,HS-grad,Divorced,Not-in-family,Male,40,<=50K
3,53,Private,234721,11th,Married-civ-spouse,Husband,Male,40,<=50K
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K
...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K
32557,40,Private,154374,HS-grad,Married-civ-spouse,Husband,Male,40,>50K
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K

In [32]:
df[df['marital-status'] == ' Never-married'][df.sex == ' Male']

/home/luisfernando/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K
13,32,Private,205019,Assoc-acdm,Never-married,Not-in-family,Male,50,<=50K
16,25,Self-emp-not-inc,176756,HS-grad,Never-married,Own-child,Male,35,<=50K
17,32,Private,186824,HS-grad,Never-married,Unmarried,Male,40,<=50K
26,19,Private,168294,HS-grad,Never-married,Own-child,Male,40,<=50K
...,...,...,...,...,...,...,...,...,...
32537,30,Private,345898,HS-grad,Never-married,Not-in-family,Male,46,<=50K
32548,65,Self-emp-not-inc,99359,Prof-school,Never-married,Not-in-family,Male,60,<=50K
32553,32,Private,116138,Masters,Never-married,Not-in-family,Male,11,<=50K
32555,22,Private,310152,Some-college,Never-married,Not-in-family,Male,40,<=50K
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K

In [33]:
df[df['marital-status'] == ' Never-married'][df.sex == ' Male'].max()

/home/luisfernando/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

age                           90
workclass            Without-pay
capital-gain             1038553
education           Some-college
marital-status     Never-married
relationship           Unmarried
sex                         Male
Hours-per-week                99
income                      >50K
dtype: object

In [38]:
df.age[df['marital-status'] == ' Never-married'][df.sex == ' Male'].median()

25.0

In [39]:
df[df['marital-status'] == ' Never-married'][df.sex == ' Male'].describe()

/home/luisfernando/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

               age  capital-gain  Hours-per-week
count  5916.000000  5.916000e+03     5916.000000
mean     28.170385  2.009348e+05       38.494760
std       9.830398  1.118275e+05       12.445145
min      17.000000  1.882700e+04        1.000000
25%      21.000000  1.216300e+05       35.000000
50%      25.000000  1.877020e+05       40.000000
75%      32.000000  2.572500e+05       40.000000
max      90.000000  1.038553e+06       99.000000

In [40]:
df[df.sex == ' Male'][df['marital-status'] == ' Never-married'].describe()

/home/luisfernando/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

               age  capital-gain  Hours-per-week
count  5916.000000  5.916000e+03     5916.000000
mean     28.170385  2.009348e+05       38.494760
std       9.830398  1.118275e+05       12.445145
min      17.000000  1.882700e+04        1.000000
25%      21.000000  1.216300e+05       35.000000
50%      25.000000  1.877020e+05       40.000000
75%      32.000000  2.572500e+05       40.000000
max      90.000000  1.038553e+06       99.000000

In [42]:
df.age[df.age >= 30].describe()

count    22850.000000
mean        44.986783
std         11.054395
min         30.000000
25%         36.000000
50%         43.000000
75%         52.000000
max         90.000000
Name: age, dtype: float64

In [43]:
df.age.unique()

array([39, 50, 38, 53, 28, 37, 49, 52, 31, 42, 30, 23, 32, 40, 34, 25, 43,
       54, 35, 59, 56, 19, 20, 45, 22, 48, 21, 24, 57, 44, 41, 29, 18, 47,
       46, 36, 79, 27, 67, 33, 76, 17, 55, 61, 70, 64, 71, 68, 66, 51, 58,
       26, 60, 90, 75, 65, 77, 62, 63, 80, 72, 74, 69, 73, 81, 78, 88, 82,
       83, 84, 85, 86, 87])

In [44]:
np.sort(df.age.unique())

array([17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67,
       68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87, 88, 90])

In [45]:
df.sort_values(by=['capital-gain'])

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
17096,25,?,12285,Some-college,Never-married,Not-in-family,Female,20,<=50K
27207,23,Private,13769,Some-college,Married-civ-spouse,Husband,Male,30,<=50K
25743,46,Local-gov,14878,Prof-school,Married-civ-spouse,Husband,Male,40,>50K
24012,26,Private,18827,Some-college,Never-married,Not-in-family,Male,40,<=50K
10826,25,Private,19214,HS-grad,Never-married,Not-in-family,Male,40,<=50K
...,...,...,...,...,...,...,...,...,...
8258,35,Private,1226583,Bachelors,Married-civ-spouse,Husband,Male,52,>50K
15569,29,Private,1268339,HS-grad,Married-spouse-absent,Own-child,Male,40,<=50K
16739,45,Private,1366120,Assoc-voc,Divorced,Not-in-family,Female,8,<=50K
18138,39,Private,1455435,Assoc-acdm,Separated,Not-in-family,Male,40,<=50K
14449,25,Private,1484705,Some-college,Divorced,Unmarried,Female,25,<=50K

In [46]:
df.sort_values(by=['age'])

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
12318,17,Private,127366,11th,Never-married,Own-child,Female,8,<=50K
6312,17,Private,132755,11th,Never-married,Own-child,Male,15,<=50K
30927,17,Private,108470,11th,Never-married,Own-child,Male,17,<=50K
12787,17,Local-gov,308901,11th,Never-married,Own-child,Female,15,<=50K
25755,17,?,47407,11th,Never-married,Own-child,Male,10,<=50K
...,...,...,...,...,...,...,...,...,...
24043,90,Self-emp-not-inc,82628,HS-grad,Never-married,Not-in-family,Male,12,<=50K
32277,90,Private,313749,HS-grad,Widowed,Unmarried,Female,25,<=50K
5104,90,Private,52386,Some-college,Never-married,Not-in-family,Male,35,<=50K
8963,90,?,77053,HS-grad,Widowed,Not-in-family,Female,40,<=50K
10210,90,Self-emp-not-inc,282095,Some-college,Married-civ-spouse,Husband,Male,40,<=50K

In [47]:
df.sort_values(by=['age']).reset_index()

,index,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income
0,12318,17,Private,127366,11th,Never-married,Own-child,Female,8,<=50K
1,6312,17,Private,132755,11th,Never-married,Own-child,Male,15,<=50K
2,30927,17,Private,108470,11th,Never-married,Own-child,Male,17,<=50K
3,12787,17,Local-gov,308901,11th,Never-married,Own-child,Female,15,<=50K
4,25755,17,?,47407,11th,Never-married,Own-child,Male,10,<=50K
...,...,...,...,...,...,...,...,...,...,...
32556,24043,90,Self-emp-not-inc,82628,HS-grad,Never-married,Not-in-family,Male,12,<=50K
32557,32277,90,Private,313749,HS-grad,Widowed,Unmarried,Female,25,<=50K
32558,5104,90,Private,52386,Some-college,Never-married,Not-in-family,Male,35,<=50K
32559,8963,90,?,77053,HS-grad,Widowed,Not-in-family,Female,40,<=50K
32560,10210,90,Self-emp-not-inc,282095,Some-college,Married-civ-spouse,Husband,Male,40,<=50K

In [48]:
columns_titles = ['age', 'capital-gain', 'Hours-per-week', 'workclass',  'education', 'marital-status',
       'relationship', 'sex', 'income']
df.reindex(columns=columns_titles)

,age,capital-gain,Hours-per-week,workclass,education,marital-status,relationship,sex,income
0,39,77516,40,State-gov,Bachelors,Never-married,Not-in-family,Male,<=50K
1,50,83311,13,Self-emp-not-inc,Bachelors,Married-civ-spouse,Husband,Male,<=50K
2,38,215646,40,Private,HS-grad,Divorced,Not-in-family,Male,<=50K
3,53,234721,40,Private,11th,Married-civ-spouse,Husband,Male,<=50K
4,28,338409,40,Private,Bachelors,Married-civ-spouse,Wife,Female,<=50K
...,...,...,...,...,...,...,...,...,...
32556,27,257302,38,Private,Assoc-acdm,Married-civ-spouse,Wife,Female,<=50K
32557,40,154374,40,Private,HS-grad,Married-civ-spouse,Husband,Male,>50K
32558,58,151910,40,Private,HS-grad,Widowed,Unmarried,Female,<=50K
32559,22,201490,20,Private,HS-grad,Never-married,Own-child,Male,<=50K
32560,52,287927,40,Self-emp-inc,HS-grad,Married-civ-spouse,Wife,Female,>50K

In [49]:
df.education.unique()

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [50]:
df.education.isin([' Bachelors', ' Masters', ' Doctorate'])

0         True
1         True
2        False
3        False
4         True
         ...
32556    False
32557    False
32558    False
32559    False
32560    False
Name: education, Length: 32561, dtype: bool

In [ ]:
df['new_column'] =

In [51]:
df['Higher_Education'] = df.education.isin([' Bachelors', ' Masters', ' Doctorate'])
df

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income,Higher_Education
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K,True
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K,True
2,38,Private,215646,HS-grad,Divorced,Not-in-family,Male,40,<=50K,False
3,53,Private,234721,11th,Married-civ-spouse,Husband,Male,40,<=50K,False
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K,True
...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K,False
32557,40,Private,154374,HS-grad,Married-civ-spouse,Husband,Male,40,>50K,False
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K,False
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K,False
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K,False

In [54]:
df[df.Higher_Education == True]

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income,Higher_Education,Education_Level
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K,True,Tertiary education
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K,True,Tertiary education
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K,True,Tertiary education
5,37,Private,284582,Masters,Married-civ-spouse,Wife,Female,40,<=50K,True,Tertiary education
8,31,Private,45781,Masters,Never-married,Not-in-family,Female,50,>50K,True,Tertiary education
...,...,...,...,...,...,...,...,...,...,...,...
32538,38,Private,139180,Bachelors,Divorced,Unmarried,Female,45,>50K,True,Tertiary education
32539,71,?,287372,Doctorate,Married-civ-spouse,Husband,Male,10,>50K,True,Tertiary education
32544,31,Private,199655,Masters,Divorced,Not-in-family,Female,30,<=50K,True,Tertiary education
32553,32,Private,116138,Masters,Never-married,Not-in-family,Male,11,<=50K,True,Tertiary education
32554,53,Private,321865,Masters,Married-civ-spouse,Husband,Male,40,>50K,True,Tertiary education

In [52]:
df["Education_Level"] = df.Higher_Education
df

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income,Higher_Education,Education_Level
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K,True,True
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K,True,True
2,38,Private,215646,HS-grad,Divorced,Not-in-family,Male,40,<=50K,False,False
3,53,Private,234721,11th,Married-civ-spouse,Husband,Male,40,<=50K,False,False
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K,True,True
...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K,False,False
32557,40,Private,154374,HS-grad,Married-civ-spouse,Husband,Male,40,>50K,False,False
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K,False,False
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K,False,False
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K,False,False

In [53]:
df.Education_Level[df.Education_Level == True] = "Tertiary education"
df.Education_Level[df.Education_Level == False] = "Basic"
df

/home/luisfernando/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/home/luisfernando/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,age,workclass,capital-gain,education,marital-status,relationship,sex,Hours-per-week,income,Higher_Education,Education_Level
0,39,State-gov,77516,Bachelors,Never-married,Not-in-family,Male,40,<=50K,True,Tertiary education
1,50,Self-emp-not-inc,83311,Bachelors,Married-civ-spouse,Husband,Male,13,<=50K,True,Tertiary education
2,38,Private,215646,HS-grad,Divorced,Not-in-family,Male,40,<=50K,False,Basic
3,53,Private,234721,11th,Married-civ-spouse,Husband,Male,40,<=50K,False,Basic
4,28,Private,338409,Bachelors,Married-civ-spouse,Wife,Female,40,<=50K,True,Tertiary education
...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,Married-civ-spouse,Wife,Female,38,<=50K,False,Basic
32557,40,Private,154374,HS-grad,Married-civ-spouse,Husband,Male,40,>50K,False,Basic
32558,58,Private,151910,HS-grad,Widowed,Unmarried,Female,40,<=50K,False,Basic
32559,22,Private,201490,HS-grad,Never-married,Own-child,Male,20,<=50K,False,Basic
32560,52,Self-emp-inc,287927,HS-grad,Married-civ-spouse,Wife,Female,40,>50K,False,Basic